src/posts/update-on-parameterized-packages.html
title: Parameterized Packages: An Update
date: 2023-06-22 13:40
tags: Guix, GSoC, Scheme
---
<p>
I started work on adding <a href="https://guix.gnu.org/blog/2023/parameterized-packages-for-gnu-guix/">Parameterized Packages</a> to GNU Guix 3 weeks ago, and this post is a short status update on the things I've done so far.
</p>
<div id="outline-container-orgf4517e7" class="outline-2">
<h2 id="orgf4517e7"><span class="section-number-2">1.</span> Summary of additions</h2>
<div class="outline-text-2" id="text-1">
<p>
I have written
</p>
<ul class="org-ul">
<li>Record types for parameters</li>
<li>Processors for boolean, non-negative parameters</li>
<li>Macros for using parameters inside package definitions</li>
</ul>
<p>
I started my work by writing draft parsers that acted on S-expressions, before moving on to records.
The parameterization process follows 3 phases:
</p>
<ol class="org-ol">
<li>Reading values from the parameter-spec record</li>
<li>Resolving the values against user-input, and returning a final parameter list</li>
<li>Applying transforms and macros in accordance with the final parameter list</li>
</ol>
<p>
The parsers can currently resolve <b>boolean</b> and <b>non-negative</b> parameters.
This means that parameters can either be <b>on</b> or <b>off</b>, and the parser does <b>not</b> automatically assume that <i>parameter!</i> implies <code>(not parameter)</code>. I am now working on adding support for enumerable parameters (i.e. parameters with multiple values which are not just on and off) and adding support for negation of boolean parameters.
I next wrote Guix-style <a href="https://www.gnu.org/software/mit-scheme/documentation/stable/mit-scheme-ref/define_002drecord_002dtype-_0028SRFI-9_0029.html">record types</a> for parameters, parameter types and parameter specification. I also wrote sanitizers and macros to make it convenient to input values in these records, as the code otherwise gets a bit boilerplate-y.
I then ported the previously written parsers to these newly made records, and also wrote a few macros that let you use parameters inside special <code>if</code> and <code>cond</code>-style expressions inside the package definition to have conditional options for fields depending on if one or all of the required parameters are switched on.
Next I wrote a macro <code>package-with-parameters</code> that returns a package definition with the default parameter transforms applied. This means that if by default my package uses two parameters <code>a</code> and <code>b</code>, the macro will return the package with both their parameter transforms applied to it.
Lastly, I wrote a modified <code>modify-inputs</code> macro that accepts parameters as conditions for the traditional modify inputs actions.
</p>
</div>
</div>
