src/org/update-on-parameterized-packages.org
* Illustrative example
*EDIT 9/18/2023:* The example has been updated to match the latest syntax.
The following code builds Guile from the git source.
Please keep in mind that the syntax is still heavily subject to change, however the underlying mechanisms will remain consistent.
#+BEGIN_SRC scheme
  (define-public guile-parameterized
    (package-with-parameters
     (parameter-spec
      (local
          (list
           (package-parameter
            (name "git")
            (variant 
             (parameter-variant-match
              (_ (with-git-url #:package-name
                               "https://git.savannah.gnu.org/git/guile.git")))))))
      (defaults '((git off))))
     (inherit guile-3.0)
     (name "guile-parameterized")
     (inputs (parameter-modify-inputs (package-inputs guile-3.0)
                                      (((git on)) (append autoconf)
                                       (append automake)
                                       (append libtool)
                                       (append gnu-gettext)
                                       (append flex)
                                       (append gperf)
                                       (append texinfo))))
     (arguments (append
                 (parameter-if ((git on))
                               (list #:make-flags #~'("VERBOSE=1"))
                               '())
                 (package-arguments guile-3.0)))))
#+END_SRC
The ~package-with-parameters~ macro takes in a ~parameter-spec~ and a ~package~ definition and gets the default parameter alist from it, and applies transformations according to it.
Here we're defining a version of guile that inherits guile code and adds a ~parameter-spec~ property.
Inside the ~parameter-spec~ definition, we start by defining ~local~ parameters. These parameters are only available to the package, and override any global parameters with the same name.
This overriding feature will make parameter specifications resilient to globalization of previously local parameters, and also make it possible to globally declare what local parameters you'd like to access across packages.
The name field of the parameter record accepts both strings and symbols, but when referring to a parameter in other fields one must use a symbol.
The variants field is explained in further detail in the [[https://blog.lispy.tech/parameterized-packages-the-second-update.html][next blog post]].
The transforms follow the usual cons cell syntax used when [[https://guix.gnu.org/manual/en/html_node/Defining-Package-Variants.html][defining package variants]].
Next we have the ~defaults~ field, which takes a list of parameters which are expected to be switched on by default.
Some fields of the parameter-spec record omitted from this example are:
- ~optional~, for declaring global parameters that can optionally be used
- ~one-of~, which is a list of lists of parameters of which only one can be used per list
- ~required~, which is a list of parameters that are *absolutely* required. It exists mostly for global parameters
- ~canonical~, which contains /canonical combinations/, a proposed feature for solving the substitute problem
- ~parameter-alist~, (not meant to be modified by the user) contains the final list of active parameters and their values, on or off.
These all come together to make it possible to define an arbitrary combination of parameters in arbitrary states and test them against the parameter-spec to see if they work and apply them if they do.
The ~package-with-parameters~ macro is proof of this working, it calculates transforms pertaining to default values and applies them to the ~package~ record defined inside it based on the contents of the ~parameter-spec~.
* Parametric Conditionals
I have written a number of conditional macros that check if a given parameter is set to on in the ~parameter-alist~ and update the ~package~ record appropriately.
~parameter-if~ and ~parameter-modify-inputs~ have been used in the example above, and below is an explanation of how they work:
** parameter-if
~parameter-if~ takes a parameter or a list of parameters and checks if any of them are on.
If they are, it returns the first expression, but if all of them are off, it returns either nothing or the second expression. It behaves similarly to Guile's ~if~ macro.
It is being used in this snippet from the ~guile-parameterized~ example:
#+BEGIN_SRC scheme
  ;; inside package definition
  (arguments (append
              (parameter-if ((git on))
                            (list #:make-flags #~'("VERBOSE=1"))
                            '())
              (package-arguments guile-3.0)))
#+END_SRC
Here, the arguments field is given a list formed by appending ~#:make-flags~ with the value ~"VERBOSE=1"~ if the parameter ~git~ is set to ~on~, or appending an empty list ~'()~ otherwise.
