src/posts/update-on-parameterized-packages.html
<div id="outline-container-orgb8edb35" class="outline-2">
<h2 id="orgb8edb35"><span class="section-number-2">2.</span> Illustrative example</h2>
<div class="outline-text-2" id="text-2">
<p>
<b>EDIT 9/18/2023:</b> The example has been updated to match the latest syntax.
The following code builds Guile from the git source.
Please keep in mind that the syntax is still heavily subject to change, however the underlying mechanisms will remain consistent.
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #7a94df;">(</span><span style="color: #c6a6b3; font-weight: bold;">define-public</span><span style="color: #c6a6b3;"> </span><span style="color: #c6a6b3;">guile-parameterized</span>
<span style="color: #c6a6b3;">  (</span><span style="color: #6f9e77;">package-with-parameters</span>
<span style="color: #6f9e77;">   (</span><span style="color: #d4878a;">parameter-spec</span>
<span style="color: #d4878a;">    (</span><span style="color: #d0b29e;">local</span>
<span style="color: #d0b29e;">        (</span><span style="color: #bbcde3;">list</span>
<span style="color: #bbcde3;">         (</span><span style="color: #6eb0eb;">package-parameter</span>
<span style="color: #6eb0eb;">          (</span><span style="color: #d6a7c4;">name </span><span style="color: #eb6ad3d3e261;">"git"</span><span style="color: #6eb0eb;">)</span>
          <span style="color: #6eb0eb;">(</span><span style="color: #d6a7c4;">variant </span>
<span style="color: #d6a7c4;">           (</span><span style="color: #3cae42;">parameter-variant-match</span>
<span style="color: #3cae42;">            (</span><span style="color: #ebb4b6;">_ (</span><span style="color: #d69b21;">with-git-url </span><span style="color: #d69b21; font-weight: bold;">#:package-name</span>
<span style="color: #d69b21;">                             </span><span style="color: #eb6acdcd9090;">"https://git.savannah.gnu.org/git/guile.git"</span><span style="color: #ebb4b6;">)</span><span style="color: #3cae42;">)</span><span style="color: #d6a7c4;">)</span><span style="color: #6eb0eb;">)</span><span style="color: #bbcde3;">)</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span>
    <span style="color: #d4878a;">(</span><span style="color: #d0b29e;">defaults '(</span><span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">git off</span><span style="color: #bbcde3;">)</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span><span style="color: #6f9e77;">)</span>
   <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">inherit guile-3.0</span><span style="color: #6f9e77;">)</span>
   <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">name </span><span style="color: #ea69c3c3c544;">"guile-parameterized"</span><span style="color: #6f9e77;">)</span>
   <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">inputs (</span><span style="color: #d0b29e;">parameter-modify-inputs (</span><span style="color: #bbcde3;">package-inputs guile-3.0</span><span style="color: #d0b29e;">)</span>
                                    <span style="color: #d0b29e;">(</span><span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">(</span><span style="color: #d6a7c4;">git on</span><span style="color: #6eb0eb;">)</span><span style="color: #bbcde3;">)</span> <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">append autoconf</span><span style="color: #bbcde3;">)</span>
                                     <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">append automake</span><span style="color: #bbcde3;">)</span>
                                     <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">append libtool</span><span style="color: #bbcde3;">)</span>
                                     <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">append gnu-gettext</span><span style="color: #bbcde3;">)</span>
                                     <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">append flex</span><span style="color: #bbcde3;">)</span>
                                     <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">append gperf</span><span style="color: #bbcde3;">)</span>
                                     <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">append texinfo</span><span style="color: #bbcde3;">)</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span><span style="color: #6f9e77;">)</span>
   <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">arguments (</span><span style="color: #d0b29e;">append</span>
<span style="color: #d0b29e;">               (</span><span style="color: #bbcde3;">parameter-if (</span><span style="color: #6eb0eb;">(</span><span style="color: #d6a7c4;">git on</span><span style="color: #6eb0eb;">)</span><span style="color: #bbcde3;">)</span>
                             <span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">list </span><span style="color: #6eb0eb; font-weight: bold;">#:make-flags</span><span style="color: #6eb0eb;"> #~'(</span><span style="color: #eb6ad3d3e261;">"VERBOSE=1"</span><span style="color: #6eb0eb;">)</span><span style="color: #bbcde3;">)</span>
                             <span style="color: #bbcde3;">'()</span><span style="color: #d0b29e;">)</span>
               <span style="color: #d0b29e;">(</span><span style="color: #bbcde3;">package-arguments guile-3.0</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span><span style="color: #6f9e77;">)</span><span style="color: #c6a6b3;">)</span><span style="color: #7a94df;">)</span>
</pre>
</div>
<p>
The <code>package-with-parameters</code> macro takes in a <code>parameter-spec</code> and a <code>package</code> definition and gets the default parameter alist from it, and applies transformations according to it.
Here we're defining a version of guile that inherits guile code and adds a <code>parameter-spec</code> property.
Inside the <code>parameter-spec</code> definition, we start by defining <code>local</code> parameters. These parameters are only available to the package, and override any global parameters with the same name.
This overriding feature will make parameter specifications resilient to globalization of previously local parameters, and also make it possible to globally declare what local parameters you'd like to access across packages.
The name field of the parameter record accepts both strings and symbols, but when referring to a parameter in other fields one must use a symbol.
The variants field is explained in further detail in the <a href="https://blog.lispy.tech/parameterized-packages-the-second-update.html">next blog post</a>.
The transforms follow the usual cons cell syntax used when <a href="https://guix.gnu.org/manual/en/html_node/Defining-Package-Variants.html">defining package variants</a>.
Next we have the <code>defaults</code> field, which takes a list of parameters which are expected to be switched on by default.
Some fields of the parameter-spec record omitted from this example are:
</p>
<ul class="org-ul">
<li><code>optional</code>, for declaring global parameters that can optionally be used</li>
<li><code>one-of</code>, which is a list of lists of parameters of which only one can be used per list</li>
<li><code>required</code>, which is a list of parameters that are <b>absolutely</b> required. It exists mostly for global parameters</li>
<li><code>canonical</code>, which contains <i>canonical combinations</i>, a proposed feature for solving the substitute problem</li>
<li><code>parameter-alist</code>, (not meant to be modified by the user) contains the final list of active parameters and their values, on or off.</li>
</ul>
<p>
These all come together to make it possible to define an arbitrary combination of parameters in arbitrary states and test them against the parameter-spec to see if they work and apply them if they do.
The <code>package-with-parameters</code> macro is proof of this working, it calculates transforms pertaining to default values and applies them to the <code>package</code> record defined inside it based on the contents of the <code>parameter-spec</code>.
</p>
</div>
</div>
<div id="outline-container-org32da485" class="outline-2">
<h2 id="org32da485"><span class="section-number-2">3.</span> Parametric Conditionals</h2>
<div class="outline-text-2" id="text-3">
<p>
I have written a number of conditional macros that check if a given parameter is set to on in the <code>parameter-alist</code> and update the <code>package</code> record appropriately.
<code>parameter-if</code> and <code>parameter-modify-inputs</code> have been used in the example above, and below is an explanation of how they work:
</p>
</div>
<div id="outline-container-org8842226" class="outline-3">
<h3 id="org8842226"><span class="section-number-3">3.1.</span> parameter-if</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>parameter-if</code> takes a parameter or a list of parameters and checks if any of them are on.
If they are, it returns the first expression, but if all of them are off, it returns either nothing or the second expression. It behaves similarly to Guile's <code>if</code> macro.
It is being used in this snippet from the <code>guile-parameterized</code> example:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #cf9f7f; font-style: italic;">;; </span><span style="color: #cf9f7f; font-style: italic;">inside package definition</span>
<span style="color: #7a94df;">(</span><span style="color: #c6a6b3;">arguments (</span><span style="color: #6f9e77;">append</span>
<span style="color: #6f9e77;">            (</span><span style="color: #d4878a;">parameter-if (</span><span style="color: #d0b29e;">(</span><span style="color: #bbcde3;">git on</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span>
                          <span style="color: #d4878a;">(</span><span style="color: #d0b29e;">list </span><span style="color: #d0b29e; font-weight: bold;">#:make-flags</span><span style="color: #d0b29e;"> #~'(</span><span style="color: #dddde6e6f1f1;">"VERBOSE=1"</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span>
                          <span style="color: #d4878a;">'()</span><span style="color: #6f9e77;">)</span>
            <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">package-arguments guile-3.0</span><span style="color: #6f9e77;">)</span><span style="color: #c6a6b3;">)</span><span style="color: #7a94df;">)</span>
</pre>
</div>
<p>
Here, the arguments field is given a list formed by appending <code>#:make-flags</code> with the value <code>"VERBOSE=1"</code> if the parameter <code>git</code> is set to <code>on</code>, or appending an empty list <code>'()</code> otherwise.
</p>
</div>
</div>
