src/org/update-on-parameterized-packages.org
** parameter-match
~parameter-match~ is somewhat similar to Guile's ~cond~, but also very different.
It takes in a set of lists of the form ~((parameters ...) clauses ...)~, wherein if any in the list of parameters is set to on, the clauses are executed. This behavior is not short-circuiting, and the other lists are checked once one is evaluated regardless of the result.
A list may be prefixed with ~#:all~ if all parameters are required to be switched on.
Also, a ~_~ can be used to always match.
For example, the ~parameter-if~ example above can be rewritten with ~parameter-match~ like this:
#+BEGIN_SRC scheme
  (arguments (append
              (parameter-match
               (((git on)) (list #:make-flags #~'("VERBOSE=1")))
               (_ '()))
              (package-arguments guile-3.0)))
#+END_SRC
~parameter-match~ has a variant called ~parameter-match-case~ which is the same as ~parameter/match~, but it short-circuits when a matching list is found.
** parameter/modify-inputs
The ~modify-inputs~ macro is used very frequently when defining package variants, but due to it being a macro we cannot use ~parameter-match~ inside it to pick arguments.
To this end, I have defined a new macro called ~parameter-modify-inputs~ that takes in a list of parameters and a corresponding list of arguments to ~modify-inputs~ that can be used instead of it.
~_~ can be used to always execute the clauses, and ~#:all~ may be used to require all parameters to be positive.
In the example package above, it has been used like this:
#+BEGIN_SRC scheme
  ;; inside the package definition
  (parameter-modify-inputs (package-inputs guile-3.0)
                                      (((git on)) (append autoconf)
                                       (append automake)
                                       (append libtool)
                                       (append gnu-gettext)
                                       (append flex)
                                       (append gperf)
                                       (append texinfo)))
#+END_SRC
Here, if the parameter ~git~ is switched on, ~autoconf~, ~automake~, ~libtool~, ~gnu-gettext~, ~flex~, ~gperf~ and ~texinfo~ are added to the package's inputs. This is quite useful as these inputs are required for building guile from its git source.
* Global Parameters
The handling of global parameters is an important topic that needs more discussion.
Right now, the idea is to require all global parameters to be defined in one file and to access them through a hash-table called ~%global-parameters~.
This is to ensure that global parameter symbols are both short and unique.
To make the process of adding values to this hash-table easier, I've written a macro called ~define-global-parameter~ that takes a parameter definition and makes it global.
For example, if I wanted to define a global parameter that disables tests for ~guile-3.0~, I can do it like this:
#+BEGIN_SRC scheme
  (define-global-parameter
    (package-parameter
      (name "guile-3.0-tests!")
      (description "Disables tests for Guile 3.0")
      (variants
       (parameter-variant-match
        (_ (without-tests . "guile-3.0"))))))
#+END_SRC
Now any package that uses this global transform will have ~guile-3.0~'s tests disabled.
* Results
It is now possible to define a package with parameters and change the parameter-alist to use the parameters.
Next, I'll be working on parsing negated and enumerated parameters, along with adding support for modify-inputs and package-rewriting in the parameter record itself.

EDIT: This work has been done, and can be seen in the [[https://blog.lispy.tech/parameterized-packages-the-second-update.html][next blog post]].

Stay tuned for updates, and happy hacking!
