src/posts/update-on-parameterized-packages.html
<div id="outline-container-org8a1a196" class="outline-3">
<h3 id="org8a1a196"><span class="section-number-3">3.2.</span> parameter-match</h3>
<div class="outline-text-3" id="text-3-2">
<p>
<code>parameter-match</code> is somewhat similar to Guile's <code>cond</code>, but also very different.
It takes in a set of lists of the form <code>((parameters ...) clauses ...)</code>, wherein if any in the list of parameters is set to on, the clauses are executed. This behavior is not short-circuiting, and the other lists are checked once one is evaluated regardless of the result.
A list may be prefixed with <code>#:all</code> if all parameters are required to be switched on.
Also, a <code>_</code> can be used to always match.
For example, the <code>parameter-if</code> example above can be rewritten with <code>parameter-match</code> like this:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #7a94df;">(</span><span style="color: #c6a6b3;">arguments (</span><span style="color: #6f9e77;">append</span>
<span style="color: #6f9e77;">            (</span><span style="color: #d4878a;">parameter-match</span>
<span style="color: #d4878a;">             (</span><span style="color: #d0b29e;">(</span><span style="color: #bbcde3;">(</span><span style="color: #6eb0eb;">git on</span><span style="color: #bbcde3;">)</span><span style="color: #d0b29e;">)</span> <span style="color: #d0b29e;">(</span><span style="color: #bbcde3;">list </span><span style="color: #bbcde3; font-weight: bold;">#:make-flags</span><span style="color: #bbcde3;"> #~'(</span><span style="color: #b736d857f5f4;">"VERBOSE=1"</span><span style="color: #bbcde3;">)</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span>
             <span style="color: #d4878a;">(</span><span style="color: #d0b29e;">_ '()</span><span style="color: #d4878a;">)</span><span style="color: #6f9e77;">)</span>
            <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">package-arguments guile-3.0</span><span style="color: #6f9e77;">)</span><span style="color: #c6a6b3;">)</span><span style="color: #7a94df;">)</span>
</pre>
</div>
<p>
<code>parameter-match</code> has a variant called <code>parameter-match-case</code> which is the same as <code>parameter/match</code>, but it short-circuits when a matching list is found.
</p>
</div>
</div>
<div id="outline-container-orgd201f2a" class="outline-3">
<h3 id="orgd201f2a"><span class="section-number-3">3.3.</span> parameter/modify-inputs</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The <code>modify-inputs</code> macro is used very frequently when defining package variants, but due to it being a macro we cannot use <code>parameter-match</code> inside it to pick arguments.
To this end, I have defined a new macro called <code>parameter-modify-inputs</code> that takes in a list of parameters and a corresponding list of arguments to <code>modify-inputs</code> that can be used instead of it.
<code>_</code> can be used to always execute the clauses, and <code>#:all</code> may be used to require all parameters to be positive.
In the example package above, it has been used like this:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #cf9f7f; font-style: italic;">;; </span><span style="color: #cf9f7f; font-style: italic;">inside the package definition</span>
<span style="color: #7a94df;">(</span><span style="color: #c6a6b3;">parameter-modify-inputs (</span><span style="color: #6f9e77;">package-inputs guile-3.0</span><span style="color: #c6a6b3;">)</span>
                                    <span style="color: #c6a6b3;">(</span><span style="color: #6f9e77;">(</span><span style="color: #d4878a;">(</span><span style="color: #d0b29e;">git on</span><span style="color: #d4878a;">)</span><span style="color: #6f9e77;">)</span> <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">append autoconf</span><span style="color: #6f9e77;">)</span>
                                     <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">append automake</span><span style="color: #6f9e77;">)</span>
                                     <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">append libtool</span><span style="color: #6f9e77;">)</span>
                                     <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">append gnu-gettext</span><span style="color: #6f9e77;">)</span>
                                     <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">append flex</span><span style="color: #6f9e77;">)</span>
                                     <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">append gperf</span><span style="color: #6f9e77;">)</span>
                                     <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">append texinfo</span><span style="color: #6f9e77;">)</span><span style="color: #c6a6b3;">)</span><span style="color: #7a94df;">)</span>
</pre>
</div>
<p>
Here, if the parameter <code>git</code> is switched on, <code>autoconf</code>, <code>automake</code>, <code>libtool</code>, <code>gnu-gettext</code>, <code>flex</code>, <code>gperf</code> and <code>texinfo</code> are added to the package's inputs. This is quite useful as these inputs are required for building guile from its git source.
</p>
</div>
</div>
</div>
<div id="outline-container-org865aa74" class="outline-2">
<h2 id="org865aa74"><span class="section-number-2">4.</span> Global Parameters</h2>
<div class="outline-text-2" id="text-4">
<p>
The handling of global parameters is an important topic that needs more discussion.
Right now, the idea is to require all global parameters to be defined in one file and to access them through a hash-table called <code>%global-parameters</code>.
This is to ensure that global parameter symbols are both short and unique.
To make the process of adding values to this hash-table easier, I've written a macro called <code>define-global-parameter</code> that takes a parameter definition and makes it global.
For example, if I wanted to define a global parameter that disables tests for <code>guile-3.0</code>, I can do it like this:
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #7a94df;">(</span><span style="color: #c6a6b3;">define-global-parameter</span>
<span style="color: #c6a6b3;">  (</span><span style="color: #6f9e77;">package-parameter</span>
<span style="color: #6f9e77;">    (</span><span style="color: #d4878a;">name </span><span style="color: #ea69c3c3c544;">"guile-3.0-tests!"</span><span style="color: #6f9e77;">)</span>
    <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">description </span><span style="color: #ea69c3c3c544;">"Disables tests for Guile 3.0"</span><span style="color: #6f9e77;">)</span>
    <span style="color: #6f9e77;">(</span><span style="color: #d4878a;">variants</span>
<span style="color: #d4878a;">     (</span><span style="color: #d0b29e;">parameter-variant-match</span>
<span style="color: #d0b29e;">      (</span><span style="color: #bbcde3;">_ (</span><span style="color: #6eb0eb;">without-tests . </span><span style="color: #b736d857f5f4;">"guile-3.0"</span><span style="color: #bbcde3;">)</span><span style="color: #d0b29e;">)</span><span style="color: #d4878a;">)</span><span style="color: #6f9e77;">)</span><span style="color: #c6a6b3;">)</span><span style="color: #7a94df;">)</span>
</pre>
</div>
<p>
Now any package that uses this global transform will have <code>guile-3.0</code>'s tests disabled.
</p>
</div>
</div>
<div id="outline-container-org95401e1" class="outline-2">
<h2 id="org95401e1"><span class="section-number-2">5.</span> Results</h2>
<div class="outline-text-2" id="text-5">
<p>
It is now possible to define a package with parameters and change the parameter-alist to use the parameters.
Next, I'll be working on parsing negated and enumerated parameters, along with adding support for modify-inputs and package-rewriting in the parameter record itself.
</p>

<p>
EDIT: This work has been done, and can be seen in the <a href="https://blog.lispy.tech/parameterized-packages-the-second-update.html">next blog post</a>.
</p>

<p>
Stay tuned for updates, and happy hacking!
</p>
</div>
</div>
